{
  "start_message": {
    "en": "Hello!\nMy name is Studiora, and I’m here for lessons 😎",
    "ru": "Привет!\nМеня зовут Студиора, и я здесь, чтобы помочь с обучением 😎",
    "hy": "Բարեւ!\nԵս Ստուդիորան եմ և ես այստեղ եմ՝ դասավանդելու համար 😎"
  },
  "choose_language": {
    "en": "Choose language:",
    "ru": "Выберите язык:",
    "hy": "Ընտրեք լեզուն․"
  },
  "help_translate_text": {
    "ru": "Я бот Studiora, созданный для того чтобы помогать людям, создавая для них уроки, с которыми они будут учиться и узнавать много нового.\n\nВесь функционал заложен в меню — посмотри и создай свой урок кнопкой «Создать Урок».",
    "en": "I am Studiora bot, created to help people by generating lessons they can learn from and discover a lot.\n\nAll functionality is in the menu — check it out and create your lesson with the \"Create Lesson\" button.",
    "hy": "Ես Studiora բոտն եմ, ստեղծված օգնելու մարդկանց՝ ստեղծելով նրանց համար դասեր, որոնց միջոցով նրանք կսովորեն և շատ բան կիմանան։\n\nԱմբողջ ֆունկցիոնալը գտնվում է մենյուում՝ դիտիր և ստեղծիր քո դասը «Ստեղծել Դաս» կոճակով։"
  },
  "button_settings": {
    "en": "⚙️ Settings\nChoose what you want to change:",
    "ru": "⚙️ Настройки\nВыберите, что вы хотите изменить:",
    "hy": "⚙️ Կարգավորումներ\nԸնտրեք, թե ինչ եք ցանկանում փոխել․"
  },
  "language_set": {
    "en": "Language set to: {lang} ✅",
    "ru": "Язык установлен: {lang} ✅",
    "hy": "Լեզուն փոխվեց՝ {lang} ✅"
  },
  "user_info_title": {
    "en": "👤 Your Info:",
    "ru": "👤 Ваша информация:",
    "hy": "👤 Ձեր տվյալները․"
  },
  "username": {
    "en": "Username",
    "ru": "Имя пользователя",
    "hy": "Օգտանուն"
  },
  "first_name": {
    "en": "Name",
    "ru": "Имя",
    "hy": "Անուն"
  },
  "last_name": {
    "en": "Last name",
    "ru": "Фамилия",
    "hy": "Ազգանուն"
  },
  "language": {
    "en": "Language",
    "ru": "Язык",
    "hy": "Լեզու"
  },
  "write_lesson": {
    "en": "✍️ Please write all details about your lesson:",
    "ru": "✍️ Пожалуйста, напишите все данные о вашем уроке:",
    "hy": "✍️ Խնդրում եմ, գրեք ձեր դասի մասին ամբողջ տեղեկատվությունը․"
  },
  "confirm_lesson": {
    "en": "Is this correct?",
    "ru": "Всё верно?",
    "hy": "Ճի՞շտ է ամենը։"
  },
  "lesson_saved": {
    "en": "✅ Lesson saved!",
    "ru": "✅ Урок сохранён!",
    "hy": "✅ Դասը պահպանվել է:"
  },
  "lesson_cancelled": {
    "en": "❌ Cancelled.",
    "ru": "❌ Отменено.",
    "hy": "❌ Չեղարկված է։"
  },
  "btn_user": {
    "en": "User 👤",
    "ru": "Пользователь 👤",
    "hy": "Օգտատեր 👤"
  },
  "btn_history": {
    "en": "History 📜",
    "ru": "История 📜",
    "hy": "Պատմություն 📜"
  },
  "btn_billing": {
    "en": "Billing 💸",
    "ru": "Платежи 💸",
    "hy": "Վճարումներ 💸"
  },
  "btn_settings": {
    "en": "Settings ⚙️",
    "ru": "Настройки ⚙️",
    "hy": "Կարգավորումներ ⚙️"
  },
  "btn_create_lesson": {
    "en": "Create Lesson 🧠",
    "ru": "Создать урок 🧠",
    "hy": "Ստեղծել դաս 🧠"
  },
  "btn_confirm": {
    "en": "Confirm",
    "ru": "Подтвердить",
    "hy": "Հաստատել"
  },
  "btn_edit": {
    "en": "Edit",
    "ru": "Изменить",
    "hy": "Խմբագրել"
  },
  "btn_cancel": {
    "en": "Cancel",
    "ru": "Отменить",
    "hy": "Չեղարկել"
  },
  "ask_study_topic": {
    "en": "What do you want to study?",
    "ru": "Что вы хотите изучить?",
    "hy": "Ի՞նչ եք ուզում սովորել:"
  },
  "ask_current_level": {
    "en": "What is your current level?",
    "ru": "Какой ваш текущий уровень?",
    "hy": "Ո՞րն է ձեր ներկա մակարդակը:"
  },
  "ask_target_level": {
    "en": "To what level do you want to reach?",
    "ru": "До какого уровня хотите дойти?",
    "hy": "Մինչև ո՞ր մակարդակ եք ուզում հասնել:"
  },
  "enter_all_in_one_message": {
    "en": "\n⭕ Please enter all 3 answers in one message.",
    "ru": "\n⭕ Пожалуйста, введите все 3 ответа в одном сообщении.",
    "hy": "\n⭕ Խնդրում ենք մուտքագրել բոլոր 3 պատասխանները մեկ հաղորդագրության մեջ:"
  },
  "example_input": {
    "en": "Example: English grammar, A2, B2\nor\nEnglish grammar\nA2\nB2",
    "ru": "Пример: English grammar, A2, B2\nили\nEnglish grammar\nA2\nB2",
    "hy": "Օրինակ՝ English grammar, A2, B2\nկամ\nEnglish grammar\nA2\nB2"
  },
  "thank_you_for_input": {
    "en": "Thank you for the information! You want to study: {topic}, your current level is {current_level}, and you aim for {target_level}.",
    "ru": "Спасибо за информацию! Вы хотите изучать: {topic}, ваш текущий уровень {current_level}, и вы стремитесь к {target_level}.",
    "hy": "Շնորհակալություն տեղեկատվության համար։ Դուք ցանկանում եք սովորել՝ {topic}, ձեր ներկա մակարդակը՝ {current_level}, և դուք ձգտում եք հասնել՝ {target_level} մակարդակին։"
  },
  "invalid_input_format": {
    "en": "Invalid format. Please ensure you provide all three parts (topic, current level, target level) separated by commas or new lines.\n Example: English grammar, A2, B2",
    "ru": "Неверный формат. Пожалуйста, убедитесь, что вы указали все три части (тема, текущий уровень, желаемый уровень), разделенные запятыми или новыми строками.\n Пример: English grammar, A2, B2",
    "hy": "Սխալ ձևաչափ: Խնդրում ենք համոզվել, որ տրամադրել եք բոլոր երեք մասերը (թեմա, ներկա մակարդակ, նպատակային մակարդակ)՝ բաժանված ստորակետերով կամ նոր տողերով։\n Օրինակ՝ English grammar, A2, B2"
  },
  "expecting_lesson_details_format": {
    "en": "Please provide the lesson details in the requested format (topic, current level, target level). Example: English grammar, A2, B2",
    "ru": "Пожалуйста, предоставьте детали урока в запрошенном формате (тема, текущий уровень, желаемый уровень). Пример: English grammar, A2, B2",
    "hy": "Խնդրում ենք տրամադրել դասի մանրամասները պահանջվող ձևաչափով (թեմա, ներկա մակարդակ, նպատակային մակարդակ)։ Օրինակ՝ English grammar, A2, B2"
  },
  "generating_lesson_pdf": {
  "en": "Generating your lesson PDF, please wait...",
  "ru": "Генерируется PDF урока, подождите...",
  "hy": "Դասի PDF-ը գեներացվում է, խնդրում ենք սպասել..."
  },
  "lesson_sent_successfully": {
    "en": "Lesson sent successfully!",
    "ru": "Урок успешно отправлен!",
    "hy": "Դասը հաջողությամբ ուղարկվեց։"
  },
    "loading_pdf_history": {
    "en": "Loading your PDF history...",
    "ru": "Загружаю ваши PDF файлы...",
    "hy": "Ձեր PDF ֆայլերը վերբեռնվում են..."
  },
  "no_pdfs_found": {
    "en": "You have no generated lessons yet.",
    "ru": "Вы ещё не создавали ни одного урока.",
    "hy": "Դուք դեռ դասեր չեք ստեղծել։"
  },
  "all_pdfs_sent": {
    "en": "✅ All your lessons were sent.",
    "ru": "✅ Все ваши уроки отправлены.",
    "hy": "✅ Ձեր բոլոր դասերը ուղարկվել են։"
  },
  "page_navigation": {
  "en": "📚 Navigate through your lesson history:",
  "ru": "📚 Листайте вашу историю уроков:",
  "hy": "📚 Դիտեք ձեր դասերի պատմությունը՝ էջերով:"
  },
  "page_info": {
    "en": "Page {current_page} of {total_pages}",
    "ru": "Страница {current_page} из {total_pages}",
    "hy": "Էջ {current_page} / {total_pages}"
  },
  "cmd_help_description": {
    "ru": "Привет! Я бот Studiora, созданный для того, чтобы помогать вам учиться и узнавать много нового, создавая персонализированные уроки.\n\nВесь функционал бота доступен через кнопки в меню:\n\n👤 Профиль — при нажатии этой кнопки вы получите информацию о вашем профиле в боте. Здесь вы увидите ваше имя пользователя, имя, фамилию и текущий язык, который вы используете. Это полезно, чтобы быстро проверить ваши данные.\n\n📚 Создать урок — это основная функция бота. При нажатии этой кнопки бот попросит вас ввести тему урока, ваш текущий уровень знаний и желаемый целевой уровень. Вам нужно будет ввести всю информацию в одном сообщении, разделяя данные запятыми или переносами строк (например: \"История, Новичок, Эксперт\"). После ввода данных бот попросит вас подтвердить их. Вы сможете либо подтвердить ввод, либо изменить его, либо отменить создание урока. После подтверждения бот сгенерирует подробный PDF-урок на выбранном вами языке и отправит его вам.\n\n📄 История — эта кнопка позволяет вам просматривать все PDF-уроки, которые вы когда-либо создавали. Уроки отображаются по 5 штук на странице, начиная с самых новых. Вы можете перелистывать страницы с помощью кнопок «◀️» (назад) и «▶️» (вперед), расположенных под списком уроков. Каждый PDF-файл можно скачать прямо из сообщения.\n\n⚙️ Настройки — при нажатии этой кнопки вы сможете изменить язык интерфейса бота. Вам будут предложены варианты: English, Русский и Հայերեն. Просто выберите нужный язык, и бот переключится на него.",
    
    "en": "Hello! I am Studiora bot, created to help you learn and discover a lot by generating personalized lessons.\n\nAll bot functionality is available through the buttons in the menu:\n\n👤 Profile — by pressing this button, you will receive information about your profile in the bot. Here you will see your username, first name, last name, and the current language you are using. This is useful for quickly checking your data.\n\n📚 Create Lesson — this is the main function of the bot. By pressing this button, the bot will ask you to enter the lesson topic, your current knowledge level, and your desired target level. You will need to enter all information in one message, separating the data with commas or line breaks (e.g., \"History, Beginner, Expert\"). After entering the data, the bot will ask you to confirm it. You can either confirm the input, change it, or cancel the lesson creation. After confirmation, the bot will generate a detailed PDF lesson in your chosen language and send it to you.\n\n📄 History — this button allows you to view all PDF lessons you have ever created. Lessons are displayed 5 per page, starting with the newest ones. You can navigate through pages using the «◀️» (back) and «▶️» (forward) buttons located below the lesson list. Each PDF file can be downloaded directly from the message.\n\n⚙️ Settings — by pressing this button, you can change the bot's interface language. You will be offered options: English, Russian, and Armenian. Just select the desired language, and the bot will switch to it.",

    "hy": "Ողջույն! Ես Studiora բոտն եմ, ստեղծված օգնելու ձեզ սովորել և շատ նոր բաներ իմանալ՝ ստեղծելով անհատականացված դասեր։\n\nԲոտի ամբողջ ֆունկցիոնալը հասանելի է մենյուի կոճակների միջոցով.\n\n👤 Օգտատեր — Այս կոճակը սեղմելով՝ դուք կստանաք տեղեկատվություն ձեր պրոֆիլի մասին բոտում։ Այստեղ դուք կտեսնեք ձեր օգտատիրոջ անունը, անունը, ազգանունը և ընթացիկ լեզուն, որը դուք օգտագործում եք։ Սա օգտակար է ձեր տվյալներն արագ ստուգելու համար։\n\n📚 Ստեղծել դաս — Սա բոտի հիմնական ֆունկցիան է։ Այս կոճակը սեղմելով՝ բոտը ձեզ կխնդրի մուտքագրել դասի թեման, ձեր ընթացիկ գիտելիքների մակարդակը և ձեր ցանկալի նպատակային մակարդակը։ Դուք պետք է մուտքագրեք ամբողջ տեղեկատվությունը մեկ հաղորդագրության մեջ՝ բաժանելով տվյալները ստորակետերով կամ տողադարձերով (օրինակ՝ «Պատմություն, Սկսնակ, Փորձագետ»)։ Տվյալները մուտքագրելուց հետո բոտը ձեզ կխնդրի հաստատել դրանք։ Դուք կարող եք կամ հաստատել մուտքագրումը, կամ փոխել այն, կամ չեղարկել դասի ստեղծումը։ Հաստատելուց հետո բոտը կստեղծի մանրամասն PDF դաս ձեր ընտրած լեզվով և կուղարկի ձեզ։\n\n📄 Պատմություն — Այս կոճակը թույլ է տալիս դիտել բոլոր PDF դասերը, որոնք դուք երբևէ ստեղծել եք։ Դասերը ցուցադրվում են 5-ական էջում՝ սկսած ամենանորերից։ Դուք կարող եք թերթել էջերը «◀️» (հետ) և «▶️» (առաջ) կոճակների միջոցով, որոնք գտնվում են դասերի ցուցակի տակ։ Յուրաքանչյուր PDF ֆայլ կարող է ներբեռնվել անմիջապես հաղորդագրությունից։\n\n⚙️ Կարգավորումներ — Այս կոճակը սեղմելով՝ դուք կկարողանաք փոխել բոտի ինտերֆեյսի լեզուն։ Ձեզ կառաջարկվեն տարբերակներ՝ անգլերեն, ռուսերեն և հայերեն։ Պարզապես ընտրեք ցանկալի լեզուն, և բոտը կանցնի դրան։"
  }
}
